{
    "croplist":["wheat","Groundnut","Maize"],
    "wheat":[
        {
            "name":"गेहूं",
            "tasks":["परिचय", "मिट्टी परीक्षण", "फील्ड प्रीपरेशन", "प्री इरीगेशन", "सीड प्रिपरेशन", "बुवाई, रिक्ति", "प्री-इमरजेंसी हर्बिसाइड"],
            "content":["गेहूं दुनिया में खाद्य फसलों के बीच प्रमुख स्थान रखता है। भारत में, यह चावल के बगल में होने वाली दूसरी महत्वपूर्ण खाद्य फसल है और देश के कुल खाद्यान्न उत्पादन में लगभग 25% का योगदान देता है। गेहूं ने खेला है। पिछले कुछ वर्षों में देश में खाद्यान्न उत्पादन को स्थिर करने में बहुत महत्वपूर्ण भूमिका। ",
                "फसल की कटाई के बाद नमूना स्थान पर किसी भी फसल के अवशेषों को हटा दें, मिट्टी को 15 सेमी की गहराई के साथ वी के आकार के छेद में खोदें। सभी कोनों और मध्य क्षेत्र से नमूने लें और अच्छी तरह से मिलाएं। 500 ग्राम मिट्टी के नमूने का परीक्षण करें और इसे प्राप्त करें। एक मृदा परीक्षण प्रयोगशाला में ",
                "धान की एकसमान वृद्धि के लिए पल्वीराइज्ड मिट्टी की आवश्यकता होती है। जीरो टिलेज तकनीक को प्राथमिकता दी जाती है, बिना उपज के नुकसान के गेहूं के उत्पादन की लागत में कटौती करना। इस विधि में, बीज और उर्वरकों को विशेष रूप से तैयार की गई मशीनों द्वारा उचित गहराई पर रखा जाता है, जो संकीर्ण गड्ढे बनाता है हेरो की खेती नहीं की जाती है ",
                "सिंचाई भूमि के लिए, गेहूं की फसल के बेहतर अंकुरण और समान विकास के लिए एक पूर्व बुवाई सिंचाई करें। अंकुरण स्तर पर स्वस्थ फसल के लिए पर्याप्त मिट्टी की नमी की आवश्यकता होती है।",
                "एक एकड़ क्षेत्र में बुवाई के लिए 45 किलोग्राम बीज की आवश्यकता होती है, अपने क्षेत्र और परिस्थितियों के लिए उपयुक्त किस्म का चयन करें। अन्य क्षेत्रों से किस्में न उगाएं, क्योंकि वे रोग ग्रस्त हो सकते हैं। बीज की गुणवत्ता की जांच करने के लिए फ्लोटेशन टेस्ट करें। बीज को सोखें। 15 मिनट के लिए 2% नमक के घोल में। खराब गुणवत्ता वाले बीज तैरेंगे, जबकि अच्छे गुण वाले बीज तल के नीचे डूब जाएंगे। तलछट को छोड़ दें। बुवाई से पहले नमक के घोल को निकालने के लिए शेष बीजों को धो लें। ",
                "फर्टिलाइज़र एप्लीकेशन के साथ सीड ड्रिल से बुआई करें। बीजों को 5-6 सेंटीमीटर गहरा रखा जाना चाहिए। उत्तर से दक्षिण तक बुवाई की दिशा का पालन करें, ताकि हर पौधे को बराबर धूप मिले। अगर खेत में कड़ा भूसा है तो रोटरी डिस्क का इस्तेमाल करें। ड्रिल या हैप्पी सीडर। दोनों मशीनों का उपयोग करें, अगर धान की कटाई के बाद मिट्टी में पर्याप्त नमी हो। ",
                "प्रति लीटर 200 लीटर पानी में 30% ईसी 1.3 लीटर में पेन्डिमथालिन को लागू करें। हर्बिसाइड के बेहतर प्रदर्शन के लिए देखभाल के लिए ठीक तिलक होना चाहिए। यह घास और मातम दोनों को नियंत्रित करता है।"],
            "startdates":[-50,-40,-15,-10,-5,0,2],
            "enddates":[-41,-16,-11,-6,-1,1,5],
            "images":["assets/images/wheat1.jpg","assets/images/wheat2.jpg","assets/images/wheat3.jpg"]
            
    
        }
    ],
    "Groundnut":[
        {
            "name":"मूंगफली",
            "tasks":["परिचय", "मृदा परीक्षण", "लाइम एप्लीकेशन", "मैनुअल फील्ड तैयारी", "बेसल उर्वरक खुराक", "बीज दर और उपचार", "पूर्व सिंचाई", "बुवाई", "सिंचाई"],
            "content":["8.26 मिलियन टन के उत्पादन के साथ, भारत में मूंगफली की खेती लगभग 5.8 मिलियन हेक्टेयर में होती है। गुजरात, तमिलनाडु के बाद गुजराती एक प्रमुख उत्पादक है। यह अच्छी तरह से सूखा रेतीली दोमट मिट्टी या मिट्टी की दोमट मिट्टी में उपयुक्त है। 6.5 से 7 इष्टतम सोल का तापमान 200C-300C है। ",
                "फसल की कटाई के बाद नमूना स्थान पर किसी भी फसल के अवशेषों को हटा दें, मिट्टी को 15 सेमी की गहराई के साथ वी के आकार के छेद में खोदें। सभी कोनों और मध्य क्षेत्र से नमूने लें और अच्छी तरह से मिलाएं। 500 ग्राम मिट्टी के नमूने का परीक्षण करें और इसे प्राप्त करें। एक मृदा परीक्षण प्रयोगशाला में ",
                "यदि मिट्टी का ph 6 से नीचे है, तो मिट्टी के बिस्तर की अम्लता को कम करने के लिए चूना लगाओ। फसल को अवधि के दौरान नष्ट करने और मिट्टी की परत से बचने के लिए खाद के साथ-साथ 8 क्विंटल प्रति एकड़ के हिसाब से चूना लगाएं।",
                "पिछली फसलों या खरपतवारों की पत्तियों से बुलबुले निकालें और साफ खेती करें। फिर से 2-3 सप्ताह के लिए मिट्टी को उजागर करने के लिए गहरी जुताई (8-10 इंच) करें। फरलो में 250 किलोग्राम प्रति एकड़ की दर से नीम की खली या कॉस्टर केक का उपयोग करें। बुवाई के समय। 2.5 किलो ट्राईकोडर्मा पानी और भूमि पर निर्भरता के आधार पर 10 वर्ग मीटर ot 20 वर्ग मीटर के आकार के मिट्टी जनित रोगजनकों से बचने के लिए वायरिंग करता है। रिज के बीच 60 सेमी की दूरी पर बिछाई जाने वाली लकीरें और फर्रियां बनाते हैं। रिज के दोनों किनारे 60 सेमी की चौड़ाई के साथ और दोनों तरफ 15 सेमी लंबाई के फर के साथ एक उठाया बिस्तर बनाते हैं और उठाए गए बिस्तर पर बुवाई करते हैं। ",
                "20 किलोग्राम यूरिया, 40 किग्रा सिंगल सुपर फास्फेट और 40 किग्रा पोटाश की प्रति हेक्टेयर की दर से रासायनिक उर्वरकों के साथ जैविक खाद की आपूर्ति करें। फर में उर्वरक की पूरी खुराक। पूरी तरह से उर्वरक के संपर्क में नहीं आना चाहिए।",
                "आपको एक एकड़ क्षेत्र के लिए 80 किलोग्राम बीज की आवश्यकता होगी। बीज की बुआई एक सीड ड्रिल से की जानी चाहिए। स्वस्थ बीज बोए जाने से पहले बीज का उपचार करें। निम्नलिखित में से किसी भी तरीके को अपनाएं। जैविक विधि: बीज को ट्राइकोडर्मा वायर से उपचारित करें। 4g प्रति किग्रा बीज की दर से। रासायनिक विधि: बीज को थरम 75% डब्लूएस 3 जी प्रति किलोग्राम बीज के साथ उपचारित करें।",
                "अच्छा अंकुरण प्राप्त करने के लिए बुवाई से पहले क्षेत्र की क्षमता को सिंचित करें। यदि यह बारिश का मौसम है तो फसल को आवश्यकतानुसार पानी दिया जा सकता है।",
                "बीज ड्रिल या हाथ ड्रिब्लिंग का उपयोग करके फ्लैट बेड पर किसी भी किस्म (40x10 प्रकार के फैलाने के लिए) के लिए 30 मीटर पंक्ति से पंक्ति और 10 सेमी पौधे के अंतर पर बुवाई करें। बीज को 5-6 सेमी की गहराई पर रखा जाना चाहिए। और मिट्टी के साथ बीज के बेहतर संपर्क के लिए मिट्टी को धीरे से दबाएं।",
                "बुवाई के 4 दिनों के बाद भूमि की सिंचाई करें। क्षेत्र की नमी के आधार पर 10-15 दिन के अंतराल पर पानी लगाएँ। पेगिंग और फली विकास चरणों में प्रवाहित होने वाली जमीन मूंगफली में महत्वपूर्ण अवस्थाएँ होती हैं। पर्याप्त नमी बनाए रखने के लिए दायर क्षमता तक सिंचाई करें।  पीक फूलों के मौसम के दौरान सिंचाई न करें। मूंगफली की फसल के लिए भूमि की सिंचाई करना सबसे अच्छा है।"],
            "startdates":[-70,-60,-30,-20,-10,-5,-2,0,3],
            "enddates":[-61,-31,-21,-16,-6,-3,-1,1,5],
            "images":["assets/images/bajra1.jpg","assets/images/bajra2.jpg","assets/images/bajra3.jpg"]
    
        }
    ],
    "Maize":[
        {
            "name":"मक्का",
            "tasks":["परिचय", "सॉइल सोलराइजेशन", "सॉयल टेस्टिंग", "फील्ड प्रेपरेशन", "सीड रेट एंड ट्रीटमेंट", "बुवाई और बेसल डोज", "प्री-इमरजेंसी हर्बिसाइड"],
            "content":["भारत में गेहूं और चावल के बाद मक्का तीसरा सबसे महत्वपूर्ण खाद्यान्न है। मक्का का उपयोग अन्न, मुर्गी पालन, पशु आहार और स्टार्च और इथेनॉल निर्माण सहित विभिन्न उद्देश्यों के लिए किया जाता है। मक्का की फसल दक्षिण में खरीफ और रबड़ी दोनों मौसमों में ली जाती है। भारत और उत्तर भारत में केवल खरीफ में। यह मिट्टी से बालू मिट्टी से लेकर मिट्टी तक बढ़ता है। ",
                "खुली मिट्टी की परतों को हल करें और मिट्टी जनित रोगजनकों को सूरज की रोशनी के संपर्क में लाने के लिए ऊपर की मिट्टी को पलटें।",
                "फसल की कटाई के बाद नमूना स्थान पर किसी भी फसल के अवशेषों को हटा दें, मिट्टी को 15 सेमी की गहराई के साथ वी के आकार के छेद में खोदें। सभी कोनों और मध्य क्षेत्र से नमूने लें और अच्छी तरह से मिलाएं। 500 ग्राम मिट्टी के नमूने का परीक्षण करें और इसे प्राप्त करें। एक मृदा परीक्षण प्रयोगशाला में ",
                "डिस्क हल के साथ खेत को एक बार जुताई करें और दो ब्लेड हैरो का उपयोग करके भूमि को बारीक टिल्ट के लिए तैयार करें। यह कड़ाही को दूर करने में मदद करता है और मिट्टी को ढीला और छिद्रपूर्ण बनाता है। इससे बीज को हाथ से पकड़ना आसान हो जाता है। इससे पहले कि 10 टन प्रति हैरो डालें। खेत में खाद की मात्रा। सभी पिछले crp के बुलबुले, मलबे को इकट्ठा करें और इसे जला दें। आदर्श मृदा Ph 5.5 से 7.5 है। मृदा में कार्बनिक पदार्थ और पानी की उच्च क्षमता की मात्रा अच्छी होनी चाहिए। बुवाई के लिए लकीरें और फर्रियां तैयार करें। 60coms का स्थान। की सिफारिश की जाती है। एक ही पंक्ति में पौधों को 20 सेंटीमीटर की दूरी पर बोया जाना चाहिए। ",
                "प्रति एकड़ 8kg की अनुशंसित बीज दर 30,000 t0 35,000 प्रति एकड़ के पौधे की आबादी होनी चाहिए।",
                "बीजों को बीज में हाथ से दबाना विधि का उपयोग करके बोना।",
                "एट्राजीन 50% WP को डोज़ में प्री इमरजेंसी वेईसाइड के रूप में लागू करें: 100 ग्राम प्रति एकड़ 200 लीटर पानी के साथ नैकपैक, बैकपैक और स्प्रेयर का उपयोग करके। डेडिकेट के आवेदन के बाद मिट्टी को परेशान न करें।"],
            "startdates":[-60,-45,-40,-10,-5,0,2],
            "enddates":[-46,-41,-11,-6,-1,1,3],
            "images":["assets/images/maize1.jpg","assets/images/maize2.jpg","assets/images/maize3.jpg"]
    
        }
      
    ]


}